Table of Contents
 Class SectionResultBase
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Section result base
[Obfuscation(Feature = "renaming")]
public abstract class SectionResultBase
Inheritance
object
SectionResultBase
Derived
ResultOfDeformation
ResultOfInteractionDiagramPlane
ResultOfInternalForces
SectionResultMesh
SectionResultOnPoints
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Loading
Loading
public ResultOfLoading Loading { get; set; }
Property Value
ResultOfLoading
 Edit this page